Repository: zangestu2Eszh/.github
Catalog: IraqWebsite/Resources/Controllers/AboutUsController.*.resx
Languages: ar

source: About Iraqi Land
ar: من نحن

source: About Us
ar: من نحن

source: CALL Us
ar: اتصل بنا

source: Company Email
ar: البريد الالكتروني للشركة

source: Location
ar: موقع الشركة

source: MAKE AN APPOINTMENT
ar: احجز موعد الان

source: MANAGER WORD
ar: كلمة المدير

source: Managers Archives
ar: ارشيف المدراء

source: Our Core Values
ar: قيمنا الأساسية

source: Our Goals
ar: اهدافنا

source: Our Managers
ar: المدراء

source: Our Mission
ar: مهمتنا

source: OUR TRUSTED CLIENTS
ar: عملائنا الموثوقون

source: Our Vision
ar: رؤيتنا

source: THE GREAT COMPANY SKILL
ar: مميزات الشركة

source: to see Organizational Chart
ar: لرؤية الهيكل التنظيمي للشركة

source: We Provide Best Advice For Your Future
ar: نحن نقدم افضل النصائح لمستقبلك

source: Years Experience
ar: سنوات من الخبرة
